
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 1 to change, 4 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-USER
  * azurerm_key_vault_secret.POSTGRES_DATABASE
  * azurerm_key_vault_secret.POSTGRES_HOST
  * azurerm_key_vault_secret.POSTGRES_PORT
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user[0].null_resource.setup_sdp_user[&#34;bar&#34;]
  * module.sdp_db_user[0].random_password.sdp_read_user_password
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS
* Delete
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password
  * module.sdp_db_user.null_resource.setup_sdp_user[&#34;bar&#34;]
  * module.sdp_db_user.random_password.sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + content_type            = ""
        id                      = "https://bar-aat.vault.azure.net/secrets/api-POSTGRES-PASS/7b68f3beba4b4a8d9cfa4241b09c7075"
        name                    = "api-POSTGRES-PASS"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-USER"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_DATABASE will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_DATABASE" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-DATABASE"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-HOST"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_PORT will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_PORT" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/bar-aat-rg/providers/Microsoft.KeyVault/vaults/bar-aat"
      + name                    = "api-POSTGRES-PORT"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      - id                      = "https://mi-vault-dev.vault.azure.net/secrets/bar-postgres-db-v15-aat-read-user-name/7fd1ccefe02844cfa3aae49c344888f6" -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> null
      - name                    = "bar-postgres-db-v15-aat-read-user-name" -> null
      - resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/bar-postgres-db-v15-aat-read-user-name/versions/7fd1ccefe02844cfa3aae49c344888f6" -> null
      - resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/bar-postgres-db-v15-aat-read-user-name" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "7fd1ccefe02844cfa3aae49c344888f6" -> null
      - versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/bar-postgres-db-v15-aat-read-user-name" -> null
    }

  # module.sdp_db_user.azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      - content_type            = "" -> null
      - id                      = "https://mi-vault-dev.vault.azure.net/secrets/bar-postgres-db-v15-aat-read-user-password/3e983708124d40048cdc7860571c03da" -> null
      - key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> null
      - name                    = "bar-postgres-db-v15-aat-read-user-password" -> null
      - resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/bar-postgres-db-v15-aat-read-user-password/versions/3e983708124d40048cdc7860571c03da" -> null
      - resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/bar-postgres-db-v15-aat-read-user-password" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "3e983708124d40048cdc7860571c03da" -> null
      - versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/bar-postgres-db-v15-aat-read-user-password" -> null
    }

  # module.sdp_db_user.null_resource.setup_sdp_user["bar"] will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "null_resource" "setup_sdp_user" {
      - id       = "9177236141629514119" -> null
      - triggers = {
          - "database"        = "bar"
          - "fqdn"            = "bar-postgres-db-v15-aat.postgres.database.azure.com"
          - "name"            = "bar-postgres-db-v15-aat"
          - "schemas"         = "public"
          - "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          - "sdp_reader_pass" = (sensitive value)
          - "sdp_reader_user" = "SDP_READ_USER"
        } -> null
    }

  # module.sdp_db_user.random_password.sdp_read_user_password will be destroyed
  # (because module.sdp_db_user is not in configuration)
  - resource "random_password" "sdp_read_user_password" {
      - bcrypt_hash      = (sensitive value)
      - id               = "none" -> null
      - length           = 20 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "()-_" -> null
      - result           = (sensitive value)
      - special          = true -> null
      - upper            = true -> null
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "bar-postgres-db-v15-aat-read-user-name"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password will be created
  + resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev"
      + name                    = "bar-postgres-db-v15-aat-read-user-password"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.sdp_db_user[0].null_resource.setup_sdp_user["bar"] will be created
  + resource "null_resource" "setup_sdp_user" {
      + id       = (known after apply)
      + triggers = {
          + "database"        = "bar"
          + "fqdn"            = "bar-postgres-db-v15-aat.postgres.database.azure.com"
          + "name"            = "bar-postgres-db-v15-aat"
          + "schemas"         = "public"
          + "script_hash"     = "09d8a0c139d2bd77f035b6069cda0083489604daea7bde6a65900fee85b1da84"
          + "sdp_reader_pass" = (sensitive value)
          + "sdp_reader_user" = "SDP_READ_USER"
        }
    }

  # module.sdp_db_user[0].random_password.sdp_read_user_password will be created
  + resource "random_password" "sdp_read_user_password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 8 to add, 1 to change, 4 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":634,"Program":"tfcmt","SHA1":"","Vars":{}} -->